Classes | Functions
Font
Functions for accessing platform independent font wrappers. More...
 Classes
struct  | API_Font_Head
Contains common information related to API_FontType. More...
struct  | API_FontType
Contains common information related to a font. More...
 Functions
GSErrCode __ACENV_CALL  | ACAPI_Font_GetFont (API_FontType &font)
Returns a font either by index or name.
GSErrCode __ACENV_CALL  | ACAPI_Font_SearchFont (API_FontType &font)
Search for a font by name.
Int32 __ACENV_CALL  | ACAPI_Font_GetFontNum ()
Get the number of fonts. You could use it to iterate over the fonts.
Detailed Description
Functions for accessing platform independent font wrappers.
Function Documentation
◆ ACAPI_Font_GetFont()
 GSErrCode __ACENV_CALL ACAPI_Font_GetFont  |  ( |  API_FontType &  |  font | )
Returns a font either by index or name.
Since
Archicad 27
Returns
NoError - The function has completed with success.
APIERR_BADINDEX - font with the given index does not exist.
APIERR_BADNAME - font with the given name does not exist.
◆ ACAPI_Font_GetFontNum()
 Int32 __ACENV_CALL ACAPI_Font_GetFontNum  |  ( |   | )
Get the number of fonts. You could use it to iterate over the fonts.
Since
Archicad 27
Returns
the number of fonts
◆ ACAPI_Font_SearchFont()
 GSErrCode __ACENV_CALL ACAPI_Font_SearchFont  |  ( |  API_FontType &  |  font | )
Search for a font by name.
Since
Archicad 27
Returns
NoError - The function has completed with success.
APIERR_BADNAME - font with the given name does not exist.